{
  "reviews": [
    {
      "text": "Whitsunday Jetski Tours (owner)2 weeks agoThank you so much for such an amazing review!We’re thrilled to hear you had an absolutely awesome experience from start to finish. Nate will be delighted to know his safety briefing comedy routine hit the mark.We’re also so pleased to hear how much you enjoyed your tour with Soph. She really is a huge asset to our team, and your kind words about her knowledge, calm approach, and positivity, even in rougher seas means a lot to us.Thank you for recommending us and we can’t wait to welcome you back on board again soon!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for such an amazing review!We’re thrilled to hear you had an absolutely awesome experience from start to finish. Nate will be delighted to know his safety briefing comedy routine hit the mark.We’re also so pleased to hear how much you enjoyed your tour with Soph. She really is a huge asset to our team, and your kind words about her knowledge, calm approach, and positivity, even in rougher seas means a lot to us.Thank you for recommending us and we can’t wait to welcome you back on board again soon!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)5 days agoThanks so much for the fantastic review! We’re thrilled to hear you had such a blast out on the JetSkis and that Daz, Sami, and the team made you feel welcome and at ease, especially as first-time riders.It’s great that the weather cleared up for you and how lucky to spot a green turtle too!Seeing the Whitsundays from the water really is something special. We truly appreciate the recommendation and hope to welcome you back for another adventure soon!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks so much for the fantastic review! We’re thrilled to hear you had such a blast out on the JetSkis and that Daz, Sami, and the team made you feel welcome and at ease, especially as first-time riders.It’s great that the weather cleared up for you and how lucky to spot a green turtle too!Seeing the Whitsundays from the water really is something special. We truly appreciate the recommendation and hope to welcome you back for another adventure soon!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for your wonderful review, Dion! We’re thrilled to hear you had such a great time out on the beautiful Whitsunday waters with Sami, Jackson, and Angel. It sounds like she certainly lived up to her name! We love that you enjoyed the Two Island Safari - it’s such an epic way to explore the islands and soak up a bit of adventure before heading back into Airlie. It’s fantastic to hear your nephew from the USA had a blast too - sharing the Whitsundays with visiting family makes the day even more special. We’ll be sure to pass on your kind words to the team; they’ll be stoked to know they helped make your experience a memorable one. Thanks again for joining us - we can’t wait to welcome you back for another ride across the turquoise waters soon! :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)a month agoThank you so much for your wonderful review! We’re thrilled to hear you had such an amazing time jetski experience. Sami will be over the moon to know she helped make your experience fun, safe and unforgettable, she really loves what she does!Spotting turtles is always a special moment, and we’re glad you got to enjoy that on your tour. Jetskiing through the Whitsundays is something truly unique, and we’re grateful you chose to share that experience with us.Thanks again for the recommendation, and we hope to welcome you back next time you’re in Airlie Beach!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for your wonderful review! We’re thrilled to hear you had such an amazing time jetski experience. Sami will be over the moon to know she helped make your experience fun, safe and unforgettable, she really loves what she does!Spotting turtles is always a special moment, and we’re glad you got to enjoy that on your tour. Jetskiing through the Whitsundays is something truly unique, and we’re grateful you chose to share that experience with us.Thanks again for the recommendation, and we hope to welcome you back next time you’re in Airlie Beach!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had a fantastic time.  Definitely recommend Whitsunday jetski tours. Bodies was a great guide, he was knowledgeable and funny. I was a bit nervous but he kept checking i was ok. The best time ever..",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)a month agoThank you so much for the wonderful review, Leanne! We’re thrilled to hear you had such a fantastic time out on the water and that the experience ended up being “the best time ever.” Brodie will be stoked to hear your feedback - he’s not only knowledgeable and fun, but he genuinely enjoys looking out for guests, especially when someone is feeling a bit nervous. It’s great to hear that his check-ins helped you relax and really enjoy the ride. We truly appreciate the recommendation and hope we get to welcome you back for even more Whitsundays fun next time you’re in town! :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for the wonderful review, Leanne! We’re thrilled to hear you had such a fantastic time out on the water and that the experience ended up being “the best time ever.” Brodie will be stoked to hear your feedback - he’s not only knowledgeable and fun, but he genuinely enjoys looking out for guests, especially when someone is feeling a bit nervous. It’s great to hear that his check-ins helped you relax and really enjoy the ride. We truly appreciate the recommendation and hope we get to welcome you back for even more Whitsundays fun next time you’re in town! :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)4 months agoThank you so much for your lovely review!We're thrilled to hear you had such a great time on the jetskis and felt safe throughout the experience. Phoebe will be so happy to know she made your trip extra special. We're glad to hear this was a highlight of your time Down Under.Hope to see you again for another adventure out on the water with us in the future. :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for your lovely review!We're thrilled to hear you had such a great time on the jetskis and felt safe throughout the experience. Phoebe will be so happy to know she made your trip extra special. We're glad to hear this was a highlight of your time Down Under.Hope to see you again for another adventure out on the water with us in the future. :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks so much for the amazing review, Richard! We’re thrilled to hear that even after visiting the Whitsundays so many times, seeing the islands by Jet Ski gave you a whole new perspective - it really is a unique way to experience this stunning part of the world! It’s fantastic to hear that your guide made the adventure so memorable and that you had such a blast out on the water. We’ll be sure to pass along your kind words to the crew - they’ll be stoked to know their energy, enthusiasm, and focus on safety helped make your day such a standout experience. We truly appreciate your recommendation and can’t wait to welcome you back for another round of fun, speed, and island scenery. Thanks again for joining us, we’re so glad you had an absolute ball! :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)4 months agoThank you so much for taking the time to write this amazing review!We're thrilled to hear you had such a thrilling adventure with us and that Phoebe and \"Bradley Cooper\" (Josh 😉) made it even more memorable with his energy and local knowledge here in Airlie Beach.Time really does fly when you're having fun.  We hope to have you back out with us in the not too distant future.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for taking the time to write this amazing review!We're thrilled to hear you had such a thrilling adventure with us and that Phoebe and \"Bradley Cooper\" (Josh 😉) made it even more memorable with his energy and local knowledge here in Airlie Beach.Time really does fly when you're having fun.  We hope to have you back out with us in the not too distant future.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Was absolutely amazing day out. Dazza was super cool and was doing good job leading group. Very friendly and professional.That on top of perfect weather and snacks provided by him, I will recommend them to everybody and will use this business again in the future.Awesome job guys!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)4 months agoThanks so much for the awesome feedback!We're thrilled to hear you had an amazing day out and that Dazza made such a great impression, he'll be stoked to hear it.Perfect weather and snacks always help too! We really appreciate the recommendation and can't wait to have you join us again in the future.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks so much for the awesome feedback!We're thrilled to hear you had an amazing day out and that Dazza made such a great impression, he'll be stoked to hear it.Perfect weather and snacks always help too! We really appreciate the recommendation and can't wait to have you join us again in the future.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Jetski Tours (owner)4 days agoThank you so much for the wonderful review! We’re thrilled to hear you had such a fantastic experience and appreciated the smaller group sizes and well maintained jet skis. Soph will be stoked to know she helped you feel safe and well looked after, even with the rougher conditions. So glad the scenery and adventure made it a highlight of your trip. Thanks for the recommendation. Hope to see you on the water again soon.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thank you so much for the wonderful review! We’re thrilled to hear you had such a fantastic experience and appreciated the smaller group sizes and well maintained jet skis. Soph will be stoked to know she helped you feel safe and well looked after, even with the rougher conditions. So glad the scenery and adventure made it a highlight of your trip. Thanks for the recommendation. Hope to see you on the water again soon.",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.9,
  "review_count": 1283,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=0ab8a8da197cc04c&si=AL3DRZHrmvnFAVQPOO2Bzhf8AX9KZZ6raUI_dT7DG_z0kV2_x3bHpub1XaBXD7JEgmoctl5W9jl6530-dfYBUbNBPZCjuuNOrbGi8aLQZXQC9XIUoEpxukQqGyQQinDjP4iMQrZbbekAlpdz0h5Lukc28MF4ulq6tw%3D%3D&q=Whitsunday+Jetski+Tours+Reviews&sa=X&ved=2ahUKEwicm7ne3oeSAxWXh1YBHeGQOioQ0bkNegQIOhAE&biw=1907&bih=790&dpr=1.25&aic=0"
}