{
  "reviews": [
    {
      "text": "An incredible day all round. The snorkelling on the outer reef was amazing. Crystal clear waters, many multicoloured fish and the beautiful coral reef. I was lucky enough to swim with a turtle. Hill Inlet views are second to none and the pristine Whitehaven beach gorgeous. The guys were informative, helpful and made the day just perfect. To be able to all this in one day was do good. Highly recommend this trip",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "We had a fantastic day out with Viper in the Whitsundays. The trip included snorkelling, plenty of time to capture photos at the iconic Hill Inlet lookout, and a chance to relax on the beautiful white silica beach. We were lucky enough to spot both a turtle and a whale, which made the experience even more memorable. The crew were welcoming, and the skipper was an excellent sailor. Even at high speed, he navigated the waves smoothly, so none of us felt seasick. The boat itself is impressively fast, which means you get to cover a lot of highlights in one day. The food was tasty, with gluten-free options available. That said, for the price, we would have expected slightly more—perhaps a higher quality meal or upgraded snorkelling equipment, as the masks weren't the most comfortable, even though anti-fog spray was provided. Our group was small but very mixed, and at times it felt like not everyone had equal access to the food when it was served. A bit more attention from the crew in managing this would have helped, as a few guests were quite inconsiderate. Overall, it was a wonderful experience and a great way to see the Whitsundays.",
      "author": "Google User",
      "rating": 4.0
    },
    {
      "text": "Amazing Great Barrier Reef Experience! I recently joined a full-day tour to the Great Barrier Reef, and it was absolutely incredible! Everything was perfectly organized from start to finish. The staff were super friendly, helpful, and made everyone feel safe and comfortable during the trip. Overall, it was an unforgettable day — great service, stunning views, and excellent food. I highly recommend this tour to anyone visiting the Great Barrier Reef. Totally worth it!",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "Our family had an unforgettable time on this tour — the boat is seriously fast (and seriously fun), slicing through the water like a rocket with views for days. We were lucky enough to spot some whales during the trip, which was an absolute highlight and something we'll be talking about for years! The crew were legends — super friendly, professional, and made sure everyone on board was looked after and having a great time from start to finish. They had the perfect balance of fun and safety, with plenty of laughs and local knowledge along the way. If you're visiting Airlie Beach and want a high-energy adventure with stunning scenery, marine life, and good vibes all around, Viper Whitsundays is a must-do. 10/10 – would race across the Whitsundays again in a heartbeat!",
      "author": "Google User",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.8,
  "review_count": 1022,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?q=Iconic+Whitsunday+Airlie+Beach+reviews"
}