{
  "overall_rating": 5,
  "review_count": 14,
  "reviews": [
    {
      "author": "customer",
      "rating": 5,
      "title": "",
      "text": "This was one of the best experiences me and my family have ever had, and it’s mostly thanks to the amazing crew on board! Special thanks to Benny, who gave us the ride of a lifetime, and Jenna, who lifted everyone’s spirits and showed us all the best places in the reef.\n\nEverything was very accommodating, even for me (as I’m not the strongest swimmer), with lots of lifejackets, floats, and equipment to make sure everyone is comfortable in the water.\n\nI in particular loved the bush walk through Whitsunday Island, and taking photos atop the lookout. Sitting on Whitehaven Beach while enjoying lunch was also wonderful, not to mention the beautiful reef when we got in the water for some snorkelling!",
      "date": ""
    },
    {
      "author": "customer",
      "rating": 5,
      "title": "",
      "text": "We had the best time with Ocean rafting!\nThe scenic flight was just breathtaking. We all had window seats and felt safe, the pilot and copilot made sure we all got to see the most important things (heart shaped island and whiteheaven).\nThe boat was great too, Dan was our skipper and the trip went smoothly. Great vibes, music on the boat, felt safe and had fun!\nOn the boat Josh and (sorry I’m sure I’ll misspell it :( ) Cordin were extremely professional, helpful and always ready to answer all our questions!\nThe snorkeling was fun and the corals insane.\nWe then went to Hill Inlet lookout which is just incredible.\nThe crew was very patient with all of us, guided us and proposed to take pictures for us. Just the nicest!!\nThe lunch was nice and my request for Celiac gluten free was perfectly met. Felt good after!\n10/10, definitely recommend!\nAlso thank you Masha too (sorry if I misspelled it!) She drove us back to our hostel and had the best vibes, super kind and professional.\nThank you once again!!",
      "date": ""
    },
    {
      "author": "customer",
      "rating": 5,
      "title": "",
      "text": "We went ocean rafting on the Southern Lights Tour with Rich and Vanessa on the boat named “Thunderstruck”and had the most amazing time. I can honestly say this was the highlight of our trip to the Whitsundays. I was a little worried about our kids traveling on a faster boat but Vanessa and Rich put our minds at ease and made the ride so much fun to the point where they were asking us to do it again! The whole experience was fun, informative and energetic. The views, the water and sea life were just beautiful. I even loved the addition of the music on the boat, it really adds to the vibe of it all. I would highly recommend this tour and will be doing it again the next time we holiday here.\nThank you to Rich and Vanessa for your professionalism, friendliness and for making our day out on the islands and day to remember!!",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Amazing day trip from Airlie Beach on the RIB 'Jammin' with crew Brent and Hayden. Visit to Whitsunday Island for pictures of Whitehaven Beach then a walk down to the beach for lunch and chill. Two great snorkeling spots during the trip back to round off the day. Great tunes, high speed donuts and good fun all 'round. Near, far, wherever you are, I believe that the heart does go on (If you know, you know).",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Absolutely wonderful day… we only had 2 nights in Airlie Beach, and this tour simply capped off the stay.\n\nAbby and Scott were incredible, very knowledgeable, capable as well as a lot of fun - both interacted so well with everyone from the group. Thank you both for making our reef trip truly memorable.",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "We picked Ocean Rafting for our boat tour around Whitsundays and scenic flight tour on seperate days! Picked us up from our accomodation and all staff and crew were super friendly and accomodating and made our experiences unreal.\n\nThanks to Ben and Finn for our fun Boat tour and shout out to Jacob our pilot who made the flight smooth and capture some amazing views of the Great Barrier Reef!",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "We had a lovely day - starting with the flight. It was absolutely amazing. Afterwards we went on the rafting tour. This was well organized with transfer buses and really friendly staff.\n\nThe boat ride was an incredibly enjoyable experience. We loved every minute of it. Josh and Lucky are great guys who made the journey unforgettable for us!!!!\n\nBIG THANK YOU TO OUR PILOT AND SKIPPERS! 😊\n\nThe only thing which we didn’t like was that Whitehaven beach and the lookout have been very busy when we came there. But this is not the company fault - it is popular spot.",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "We had the most incredible day with Ocean Rafting in Airlie Beach! Our adventure started with a semi-private flight over the stunning Whitsunday Islands and the breathtaking Whitehaven Beach, followed by a flyover of the Great Barrier Reef and the iconic Heart Reef — absolutely unforgettable!\n\nThe second part of the day was an ocean rafting experience with the amazing crew, Ella and Skipper Daisy. Who would have thought that two young ladies could bring so much humour, energy, and adventure to the day? We hiked to see Whitehaven Beach from above, went snorkeling, and relaxed on the beach — every moment was perfect.\n\nAnd special mention to their fantastic playlist on the boat — it added so much fun to the trip! 🎶 Wishing all the best to this incredible team — thank you for making our day truly unforgettable! 💙",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Jess, Georgie and Chris were nothing short of exceptional for our ocean wrafting experience. They were attentive, welcoming, friendly and great fun. We felt at ease with them from the beginning and they set the tone for a great day. They showed excellent attention to the safety and enjoyment of everyone at all times, not to mention their outstanding patience for those who were new to this kind of experience. They had energy and smiles on their faces from start to finish and really put everyone at ease. A once in a lifetime experience, would do it again tomorrow if we could! Well done to the crew on board, you guys are great at what you do! Tens across the board!! Thank you!! Caitríona and Annabelle 🫶🏼",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Amazing day with the Ocean Rafting crew! Picked up from our accom and transported to the Port where we sorted the gear we needed. I was on crutches and the team were super helpful to me. We loved the speed boat stunts and the diving - absolute magic! We got lunch included and it was high quality and fresh. Harry, Chris and Brad were legends and took good care of us all and made sure we had a good day. Highly recommend as a must do when you visit!\n",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "We had an incredible day out on the water with Ocean Rafting on the Southern Lights Tour - out of Airlie Beach. Max, Corbin & James were a great crew and added to the days fun!! We made our way out to Whitehaven Beach & Hill Inlet lookout. It was a great day, did a bit of snorkelling and were able to see the stunning views of the Whitsundays. Day ended relaxing on the south end of Whitehaven beach & it was stunning!! Highly recommend this Tour 🤩🙌🏼",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Did the Southern Lights tour at the end of September. Had a brilliant day with the family. Lots of fun and an experience we will never forget. Scenery and snorkeling were expceptional on our day. Crew were informative and professional whilst keeping a fun atmosphere the whole time. Did one other tour with another group on Hamilton and this was the better of the two.",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "We did the Ocean Rafting tour on the Wild Things boat and it was honestly such a great experience. Our captains, Abby and Brent, were absolutely incredible, super kind, fun, and genuinely knowledgeable!! Even though the weather wasn’t perfect, they still took us to the best snorkelling spots for the conditions and made the whole day enjoyable.\nWe got plenty of time to take photos, explore the beach, and enjoy the views. Both snorkel stops were amazing and we never felt rushed at any point. Abby and Brent kept the energy up, shared lots of interesting info about the area, and made everyone feel really comfortable.\nOverall 10/10 recommend!!",
      "date": ""
    },
    {
      "author": "Customer",
      "rating": 5,
      "title": "",
      "text": "Hands down the best day we had in Airlie Beach! The fast raft ride was an absolute blast, the crew were hilarious and looked after everyone perfectly. Snorkelling was incredible with heaps of fish and coral, and the small group (only 30-ish people) made it feel special instead of crowded. Lunch was fresh and delicious too. Worth every dollar – if you’re in the Whitsundays, do Ocean Rafting! 🚤🌺🏝️",
      "date": ""
    }
  ],
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=eb5b4f820ac811f1&si=AMgyJEuzsz2NflaaWzrzdpjxXXRaJ2hfdMsbe_mSWso6src8sx7FMmoFJcn-OPcoqcrRKaGmCcCstRPWtwy83vZ6jHyTkEP9aXd7NcBxA2pAJUvnXxANIAFvrBgiTdfmfqW0D-rNdv85&q=Ocean+Rafting+Reviews&sa=X&ved=2ahUKEwiOhP7u08aQAxUai68BHbq8OXwQ0bkNegQIKRAE&biw=1536&bih=730&dpr=1.25"
}