{
  "overall_rating": 5,
  "review_count": 20,
  "reviews": [
    {
      "author": "Customer",
      "rating": 5,
      "text": "Coral Sea Marina Resort North, 1-3 Shingley Dr, Airlie Beach QLD 4802Place location"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Coral Sea Marina Resort North, 1-3 Shingley Dr, Airlie Beach QLD 4802"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Your responses help to improve the Google Search experience.Note: Your feedback won't directly influence the ranking of any single page.Learn more"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Kathy for your detailed review and sorry the weather wasn’t kind. But sounds like you certainly appreciated that you were on a sailing boat and enjoyed the day. We do appreciate your feedback."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Anna. Yes Whitehaven Beach is a distance from Airlie and sailing does take longer to get there which is also part of the experience. Will pass on your thanks to the crew."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Hannah. Will let Jack and Fionn know what a wonderful time you had and thanks so much for letting us know"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "What an incredible review – thank you so much for sharing your day with us! 🌊☀️ We’re so glad you loved the laid-back pace of sailing and that the weather turned on its best for you. Spotting turtles and dolphins is always such a treat, and it’s wonderful to hear you enjoyed the food, beach time, and snorkeling as much as the cruise itself.We’ll be sure to pass on your kind words to the crew – they’ll be thrilled. Nothing makes us happier than knowing your day with Providence V has been the highlight of your East Coast trip! ✨We’d love to welcome you back onboard anytime.Whitsunday Sailing Providence V/MiLady"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Trace for finding time to give such a detailed review. And Grant and Kevin are delighted with your kind words. And glad you enjoyed the day.We really appreciate your feedback."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Tom. Taking what you’ve said onboard. Sailing and getting there is part of the experience.We do go to Whitehaven Beach.  The part of Whitehaven where you can see the amazing colours from Hilll Inlet. Betty’s Beach is a little cove at the northern end of Whitehaven Beach and also a lovely spot Our destination is by far the best part  accessible during your 1.5 hours on the beach. Not sure if you went there?"
    },
    {
      "author": "Rae-Anne Diehm",
      "rating": 5,
      "text": "We did the sunset cruise. This is a relaxing way to spend time in the calm waters off Airlie Beach, in the cool of the day. Once we left the Marina the skipper cut the engine and hoisted the sail. The sparkling wine and cheese platter were delicious. The crew were lovely, very friendly and professional with a great sense of humour."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Hi Meg and you are so right about sailing. It is about being out in the elements compared to a ferry or fast boat. And if you enter into the spirit, that's what sailing is about. Thanks so much for your kind review and putting everything in context."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Hi Nathan, Apologies for slowness in responding. Thanks so much for finding time to review us."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Mark for your kind review and really glad you had such a great day and saw some of the beautiful marine creatures that makes our destination so special.Thanks for taking time to review us."
    },
    {
      "author": "Sheila Scutter",
      "rating": 5,
      "text": "Very pleasant day out on the boat with a friendly and knowledgeable  crew.  We hadn't expected the quite long walk to the lookout and Whitehaven Beach..make sure you take a water bottle! There were not drinks available on board, except for a water esky. Pity we couldn't sail, but we can't control the weather!"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Paul. Sounds like you're a real sailor and thanks for entering into the spirit of the evening and finding time to review us."
    },
    {
      "author": "Rachel Lundy",
      "rating": 5,
      "text": "Great day out on board beautiful sailing boat to Hill Inlet followed by a fantastic snorkelling spot which was far better than the main reef.  Even saw a turtle .   Tom was very knowledgeable about the area and had some great memorable stories"
    },
    {
      "author": "Annette Munro",
      "rating": 5,
      "text": "We had the best holiday aboard Milady. The crew were great, the food amazing and they took us to see the best of the Whitsundays in wonderful comfort. This is a once in a lifetime trip for 3 days of sailing 😁"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Annette and apologies it took so long to reply. We love hearing reviews about MiLady and really glad you had such a great time."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Thanks Alan and apologies for the late reply. We really appreciate you detailing your experience with us and giving us a great review."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Whitsunday Sailing | Whitsunday's Sailing Tour & Boat Hireswhitsundaysailing.com.auhttps://whitsundaysailing.com.auwhitsundaysailing.com.auhttps://whitsundaysailing.com.auA Great Experience!The Sunset Cruise on the Providence was amazing. The Captain and Decky were great.Professional ,skilled, and very knowledgeable about the ...Read more"
    }
  ],
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=2233a96e66cd7b17&si=AL3DRZHrmvnFAVQPOO2Bzhf8AX9KZZ6raUI_dT7DG_z0kV2_x36dH0Cvo7mnBa0VCh93Ixs43odo_ZiVPnKqzCGQ-buRCx_u22xZnJ9bA-xo2G2TjCk8c3ydX9p-bEGZQ5OBoBDBa1nbQg771YBuGjY5-8tjDj17Zg%3D%3D&q=Providence+Whitsunday+Sailing+Reviews&sa=X&ved=2ahUKEwj95-iExqaSAxVqslYBHQMKF_MQ0bkNegQIRBAH&biw=1536&bih=730&dpr=1.25&aic=0"
}