{
  "reviews": [
    {
      "text": "We had a wonderful time. Our guides were very knowledgeable and experienced. Due to the weather the tour had to be changed slightly but we still had a great day. We were lucky enough to spot a turtle or two aswell.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What a fantastic day of paddling - the water was amazing - thoroughly enjoyed getting to Turtle Island and exploring there. Awatea and Toby were awesome guides - so knowledgeable, funny and friendly. Thanks for a great paddling adventure.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "It was my first time kayaking. I did half day tour experience. It was awesome 🤩. Guides were really helpful in providing safety briefing and information about island,turtles and mangroves. Really thankful to the guides as they were friendly in taking our pictures. Great time!!!! Highly recommend ⭐️⭐️⭐️⭐️⭐️",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Was my first time kyaking and it was a great experience. The guides were very helpful and friendly especially Bess. Thanks for a great day. Recommend Saltydog Sea Kyaking if you're looking for a fun day.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had an absolutely amazing day, the team were very friendly and knowledgeable. Really was a great day and we will definitely be planning on coming back. Thank you very much guys, Nicole and Grant.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Did the half day kayak with Toby, Hayley and Maya and had a great time! We had strong wind and they kept us safe and we still enjoyed the reef and beach. Good value, easy pickup and good equipment, I’d recommend for anyone visiting.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Excellent tour. Great pace. Wonderful tour guides and we saw turtles!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "A fantastic tour which i have done twice this week. Recommended 🤩",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Overall a great experience.   As experienced kayakers it would have been a better experience for us if we could paddle more, visit another island, however, I understand it was a general public experience.  Maybe in the future, you can run a Beginners AND Advanced Kayak session.  Great morning.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Not sure how I missed this brilliant review. Thanks for taking the time to share how much you enjoyed your time with us and how you both felt welcome so Charlie. We have been following your adventures around the world. You are both making the most of your lives - keep living the dream! Hayley",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks guys, this is a brilliant review. I will certainly pass this in to Lachie. Also, thanks for the compliments on the food. See you in 2022 Hayley",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "TestimonialsSalty Dog Sea Kayakinghttps://www.saltydog.com.au› testimonialsSalty Dog Sea Kayakinghttps://www.saltydog.com.au› testimonialsCustomers praise the friendly staff, great guides, excellent food, and the beautiful Whitsunday Islands, with some mentioning a special proposal and whale ...",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Customers praise the friendly staff, great guides, excellent food, and the beautiful Whitsunday Islands, with some mentioning a special proposal and whale ...",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Salty Dog Sea Kayaking | Airlie Beach QLDFacebook · Salty Dog Sea Kayaking5.4K+ followersFacebook · Salty Dog Sea Kayaking5.4K+ followers",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.8,
  "review_count": 177,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=c3fe999626797709&si=AMgyJEvkVjFQtirYNBhM3ZJIRTaSJ6PxY6y1_6WZHGInbzDnMdyjIyGGTOoPTtxY_eXr-JfCs3xV-nU7QiJcOAUEU1CrEIEZ1Pld-y66s65giA3WuoCiAnajv5ntWJun1H0X-AmwxF92VIXXJD3z4GXAQuUeO2qtUQ%3D%3D&q=Salty+Dog+Sea+Kayaking+Reviews&sa=X&ved=2ahUKEwjktsjcubmQAxU9qVYBHSy9AJAQ0bkNegQIPBAE&biw=1536&bih=730&dpr=1.25"
}