{
  "reviews": [
    {
      "text": "What an amazing experience! Loved the crew, only good vibes. We had the most beautiful views while sailing through the Whitsundays. Skipper Thomas ensured smooth sailings and all other aspects as food and safety. Thanks crew ❤️",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Epic to hear you had such an amazing time! Only good vibes is exactly what we aim for, so we’re stoked the crew and skipper Thomas delivered an unreal experience for you — smooth sailing, stunning views and all the little details taken care of. Thanks so much for sailing with us! :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Wow - what an amazing review to read, thank you! :)We are stoked to hear your trip was such a highlight. Tom, Mathias & Dries will be frothing to hear of your shout-out too - they really do love what they do! Thanks for sailing with us and for sharing the love!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an incredible review - thank you for sharing your experience! We’re so happy to hear your time on Condor with Ben, Diego and Miyabi was so great!! They will love knowing their knowledge, energy and thoughtful planning helped make the experience so special for you! Thanks very much for the glowing recommendation, we'd have you back sailing with us anytime!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What a beautiful reflection – thank you so much! :)We absolutely love to hear your time on Condor was filled with joy, connection, and unforgettable moments. Mathias, Bam, and Dan will be so happy to know they helped make your Whitsundays experience so special. From sunsets to snorkelling to surprise whale sightings – it sounds like you really soaked in the magic of the Whitsundays. Thanks for sailing with us :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "The most incredible experience! The Whitsundays were stunning, the people great and the crew exceptional. Had the best few days and one of my favourite experiences in Australia so far! Thank you so much and big shout out to Romain, Ryan and Sam you were amazing!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I really enjoyed the 2 day Whitsundays islands tour with Prosail. The crew were very professional and fun and created a fantastic atmosphere on board. The food on board was great, and we were brought to all the good spots in the island to visit beaches and to snorkel in the reef. Would highly recommend this trip.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "2D2N spent on the Condor boat with captain Dan and crew Matthias and BAM (Bella). Was the most amazing trip sailing around the Whitsundays. Food was AMAZING cooked by the crew and good chat from everyone. Anchor and snorkelling locations were unbelievable will definitely be using pro sail if I sail the Whitsundays again!",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.9,
  "review_count": 634,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=c3fe999626797709&si=AMgyJEuzsz2NflaaWzrzdpjxXXRaJ2hfdMsbe_mSWso6src8s488LX57yWx3LeBhd0jpxXEUknm6anNE411itC1cCotAkOqKxTnD_7AhP_VM6XIsCKVdYjmZzcrxJ7zelSPQ6d5Ev5BTFKhAWAfs9foE2CpwdECI8Q%3D%3D&q=Prosail+Whitsundays+Reviews&sa=X&ved=2ahUKEwj5u92UubmQAxXrklYBHeaHHSgQ0bkNegQIOhAE&cshid=1761192615374464&biw=1536&bih=730&dpr=1.25"
}