{
  "reviews": [
    {
      "text": "Went on this tour via an excursion from a cruise ship and had a fantastic time!I am an ambulatory wheelchair user and found this relatively easy to access. There was only a few (15-16) steps that weren’t to steep to get into the boat to do …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Recently travelled from Canberra. The tour operators made it super easy, with pickup from our hotel accommodation. The crocodile tour was full of history and useful accomodation. Lunch and afternoon tea was provided and was absolutely …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "The crocodile tour itself is great. Saw many crocodiles both large and small. However the tractor ride around a property lacked interest. We appreciated the knowledge of the land and animals, however we were there to see crocodiles… double the time on the water would have been cool!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Such an excellent, well run, and informative tour with variety. Definitely well worth the price paid. Got picked up by bus from a location closeby my hotel. Enjoyed a drive through the local farmland and Proserpine town, to the croc safari …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was a very informative tour. We learnt a lot about trees that can be used for different thing. Steve was amazing guid around the wetland. And an even better one on the water 2hrs croc spotting and we weren't disappointed we seen at …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Fantastic tour, never been so close to a full grown croc before. Steve and Ian know their stuff and their BBQ is great too!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We did the tour this Saturday and it was just fantastic. Extremely well organized, fun, and interesting. Beautiful landscapes and we saw MANY crocodiles really upclose (and other wildlife as well). Steve made sure to always turn the boat in …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We took our boys (7 and 9) along, and they loved the experience. It consists of 3 parts - a tour of the property and some local fauna in a tractor pulled \"train\" which was quite fun to start off with - we saw some wallabies, local birds and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What a great day!!! From pick up at our hotel to drop off this trip was informative, humorous and just great fun. It's something for all ages! Along with myself (20's) and 3 people in their 30's, we also had my Mum (50's) and my nephew who …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Absolutely loved every minute of our crocodile safari. Being picked up from our accommodation was inclusive in the price.Our guide Stew had a wealth of knowledge about Crocodiles and their environment. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an amazing opportunity. Thanks, Steve and the team. Had an unbelievable experience with the crew here and highly recommend these guys for a tour.  The talks were informative,  clever, and entertaining. We booked via our P&O cruise but …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "The best experience in Australia! Wow, from the start to the finish we loved this trip. The hosts were amazing- very informative and friendly. The crocs were out en mass, we saw at least 5 fully grown and 10-20 young crocs! The food and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "As a group we had opportunity to participate in the tour. The operator is very knowledgeable and is eco sensitive to the river and surrounding areas. His assistant cooks a great bbq, as well as billy tea and damper. Overall quite a good few hours learning about crocodiles and their habitats.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "2.5/5. The guides are what I would highly rate on this tour. Full of knowledge and friendly, however the tractor ride just seeing birds and trees didn't add any value. We saw one croc and a few very small babies most of the boat ride wasnt …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Really great 3/4 day out! Great to see crocs in their local environment, hosts were experts and super friendly. Great lunch and afternoon tea provided. Great Australian experience all round!Even pick you up from the Big4. Too easy!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Crikey what an amazing experience, not at all what we expected to actually get up close and personal with so many crocodilesWe literally couldn't believe it. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was an excellent trip. Steve was very knowledgeable and as a local I found the whole day very interesting. I will definitely recommend it!Also as someone who's done lots of trips in the Whitsundays with dietary …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Our guides provided a brilliant tour of the Proserpine River by showing us up close the crocodiles and birds. It's obvious the care that they take to be eco-conscious and minimise their footprint on the area. We chose this tour specifically …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Despite the rain, it was exciting to spot four large crocodiles and heaps of small baby crocs which is a rare sight during summer. The food and damper were very good. The tour guides experienced and friendly. However, the tractor ride …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "A unique experience. Highly recommended day tour to spot wild crocodiles. The safari tour is very informative not only in terms of crocodiles but also about the local flora and fauna, history and aboriginal knowledge. Safety is taken as a …More",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.8,
  "review_count": 423,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E0EwlFPItd-DP6i_bMsEw24TenUdQyyG0jGNO7bQIWoBsorcXqeljYkzSqGBJpesAQsjaglI5R9aLj7xMRuyBHIvJ2pbKe2lgdN9ceIZb50KAGeBNA%3D%3D&q=Whitsunday+Crocodile+Safari+Reviews&sa=X&ved=2ahUKEwjglMjkwJ2QAxUDUGwGHV4fMwkQ0bkNegQIOhAE&biw=1907&bih=788&dpr=1.25"
}