{
  "reviews": [
    {
      "text": "I signed up for the \"Explore: Great Barrier Reef Snorkel Tour from Airlie Beach\". Firstly this tour does not depart from Airlie but from shute harbour hence why it starts at 6:45am, they also do not collect you from your hotel as other …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Did a reef dive at Bait Reef with these guys and it was AMAZING!  Their mooring out there is inside the reef which keeps it protected even in crummy weather.  They also don’t take nearly as many people out to the site as the Cruise …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Ian!Thanks so much for taking the time to leave us this lovely review! It's so helpful to both us and others to hear about your experience. We're absolutely stoked you had a great time :)Cheers,The Explore Team!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "To get more reviews of the same company look at explore group - Hamilton. We were picked up in Shute Harbour and then the boat stopped in Hamilton island to get the majority of the passengers. From Airlie beach, it’s about 3-3.5 hours each …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Our day trip to the outer reef with Explore was wonderful! The crew on board were exceptional and made our day one to remember. Peyton especially went far beyond what was required to make our experience great! Will definitely use this company again. Love the professional yet fun approach!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing group, especially because the crew is 100% dedicated to the tours... I started off quite disappointed because we couldn’t head off to the Great Barrier Reef due to weather conditions but they took us snorkelling to some amazing …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Scam company, we got cancelled to our trip, no alternative arrangement! No compensation.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "3 tours and each had excellent staff who were absolutely amazing. Best tour boats we have been on. Quality of service, knowledge and friendliness was impeccable. Want a great tour go with Explore Hamilton Island.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We booked the night before at 5.40pm through a travel agent at airlie because explores online system said it is still available. We received a confirmation email and then arrived the next morning at 6.45am (email said boat was leaving …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Extremely disappointed to book a full day snorkeling tour with the family on my daughters birthday for them to call the morning before to advise they had double booked and they had to unfortunately cancel our day. Not to mention we then had to chase for a refund of our money. Extremely disappointing",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I witnessed guide Mack saving someone, it was incredible! We all were so impressed and felt so safe. Had so much fun, would recommend!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Great team and very good snorkeling. I felt very comfortable in the ocean and the view of the reef was amazing, best I've done in Australia do far.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hey Alena - wow what a great review. It was our pleasure having you on board. Thanks so much for taking the time to let us and others know about your experience with us. We really appreciate it!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Such great staff!! They were so welcoming and really made our day more enjoyable. I highly recommend them for your day out. Thank you crew of Yellow boat 23/4/19",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hey Andrew, thanks for the lovely review. Our staff take great pride in making sure our guests have the best time out at the Great Barrier Reef, so we're really glad this is something that came across in your experience. Thanks for choosing Explore!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We did dive and snorkeling tour and that was fantastic! Guys are really professional and that was one of the best days from our holiday! Good job!",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 0,
  "review_count": 0,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E58wsJ4x_EqOz10PunqWzIBRfIM-wY_XWwRU4IWI-mNhkcrNXVKt1JQLNicSK-p02_g5hs-4GkM10F4svoFUVCxxTEvlyKLFaI9CBjDFT7D8QJD2TuGrRQ67qCHiRHOTEGnsnss%3D&q=Whitsunday+Explorer+-+Explore+Group+Reviews&sa=X&ved=2ahUKEwjw_5P6wJ2QAxVrRmcHHXuMOL0Q0bkNegQINxAE&biw=1907&bih=788&dpr=1.25"
}