{
  "reviews": [
    {
      "text": "10/10 experience!Had the most epic time on New Horizon for a 2 day/2 night sailing adventure. Sailing through the beautiful Whitsundays with whales and dolphins was such a …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Unreal experienceEverything from the crew to the food and even the living quarters were comfy. Not to mention the absolutely stunning views and activities we were able to do. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had the best time on the Clipper! So much fun, amazing crew and good food. Super social with fun activities whilst you get to see and learn about the beautiful Whitsunday Islands, Whitehaven Beach and Great Barrier Reef. And let’s not forget about the stunning sunsets. Highly recommend, simply a 10/10!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Best trip ever!! The crew are great fun and take good care of ya! Food was delish and plentiful. Thanks Elle<3 we had the best time with the activities —jumping, going down the slide, snorkelling, Whitehaven beach, white party 🥳 Will recommend to all my friends and fellow travellers!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "An amazing experience on the New Horizon boat with an incredible crew, who were so welcoming . Matt in particular was very kind and friendly and always cooked the best meals, the food on the boat was absolutely insane. Sleeping conditions …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What a way to see the Whitsundays. Start to finish, an amazing inclusive experience. The crew took care of every need and kept us feeling extremely safe. Harry especially as our skipper, sailing through some big waves and taking us for some …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Liam, Keely, Lash, and Harry are the most epic crew! They ran a great trip, made sure everything ran smoothly, encouraged fun among the group on board, and kept the stoke going the entire time! Some highlights were definitely the inflatable …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Going to see the Whitsundays on the Atlantic Clipper has been such a highlight of my trip in Australia. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Best trip ever! Had an amazing three days with a great crew and we had lots of time exploring the whitsundays on and off the boat. Very social and made so many friends, would recommend to any one who wants a memorable time in an incredible place :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Really nice experience sailing the Whitsundays, there was 31 of us on board along with 4 crew. The crew were fantastic and did a great job ensuring everyone had a nice time - big thanks to Ben, Enzo, Harry and Millie! Ben made everyone feel …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had the best great 3 day trip on the Atlantic Clipper, the staff ensured we had a fun time, saw all the sights, and the chef on board cooked great food! The nights were filled with games and music! Definitely recommend!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an amazing experience! The crew made our trip so so special and we’re continuously fun, joking around and making us feel at home. Jordan made some incredible meals which reminded us of a good home cooked dinner. I would highly recommend this trip, we saw some stunning places and made some amazing memories on the boat!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had an absolutely amazing time on the new horizon!! Jackson, Harry, Nathan, & Ayla were the best crew and made our trip so much fun. Beds were comfy, food was delish, activities were well planned out and overall everyone had a great time. No complaints!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an experience! I've had one of the best times of my life. Snorkeling and chilling at Whitehaven beach was my favourite. The whole crew is legendary, thank you Matt, Pudge, Jackson, Taine, and Jmac for taking such good care of us!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Highlight of my trip to Australia. The crew were absolutely incredible from the first minute, welcoming us, explaining instructions and just feeling like a personal friend! Ayla the skipper made us feel safe and welcome, Jordi was fun, …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I had such an amazing time. I’d describe it as a hostel on a boat. Nothing but good vibes, amazing people, friendly crew. Only difference is the food is just so much better!!! Definitely recommend. It’s all so chill and relaxed but you find …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This trip was amazing, my time on the New Horizon was the best time I’ve had in Australia thus far. Big Big, Tommy, Disco Stu and of course Ayla our skipper are all amazing. They make the whole trip fun, informative, welcoming and there are …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "New Horizon was genuinely the best few days of my trip.I was very scared to go on it at first due to travel sickness, but once i was on there i felt absolutely fine. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Awesome experience. We saw a lot of whales, a turtle, a few sharkies, stingrays and even a squid. The crew is absolutely amazing. The sunrise, sunsets and the stars where amazing. & the food was amazing as well. I was so happy that I didn’t get wraps again. 10/10 would recommend",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "An absolutely amazing experience on the Atlantic Clipper… 2 nights and 3 days of paradise! The crew were fantastic, everything was so well thought out and organised, the food was delicious and the activities were so fun! So a HUGE thanks to …More",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.9,
  "review_count": 2985,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E5zSWwS8-PSNlGsaegxRmoU6hyqpRrvoZMhwgbyOT9KzYDHN1Wpm2SdpZKkppto_WDsX31-2gSMDcMH-eO3so9zO0WU6Z7Q3RL41VagMOEgy6J63_iRed_mX_QvBCAv8uM0pq-M%3D&q=True+Blue+Sailing+%28official+site%29+Reviews&sa=X&ved=2ahUKEwim6KWIwp2QAxXETGwGHaL-A7cQ0bkNegQIOhAE&biw=1536&bih=730&dpr=1.25"
}