{
  "reviews": [
    {
      "text": "We had a SNORKEL trip to the outer Reef yesterday and it was Amazing. The ride out took longer than expected, as the reef is quite a distance from Airlie Port. It was a beautiful day and the whole time on the trip out we soaked up the sun …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Got the boat at Arlie beach port, no hassles parked at the car park outside the Whitsundays cruise terminal. 11 dollars for 8 hrs or 13 dollars for the day. Pay by card easy to use no silly app required. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had a full day chill & grill tour with CW the other day in August. Awesome weather a bit chill but sunny and no rain and you will have a good chance to spot whales along the way to Whitsunday island. Everything is amazing. We allow to spend …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Staff was really great, such friendly people and good energy, really made the day memorable! No complaints for the day itself! …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had an enjoyable full day trip to Hill Inlet and Whitehaven Beach. Departed from Port of Airlie where there is delicious coffee and plenty of places to sit. My second trip to Whitehaven. Did a half day tour with another company and didn’t …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Did the \"Whitehaven Beach Chill 'n' Grill\" day package with Cruise Whitsundays, and it was worth every penny. At first, I didn't rent the cabana for extra $, but changed my mind and got it - also worth every penny. Great staff, nice boat, …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Headed out today on the Camira for a snorkelling and Whitehaven beach adventure. Had a great day. Every that you needed was supplied, snorkelling and mask, fins, stinger suit and tender from the boat to the snorkelling reef. The reef was …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Great experience with Cruise Whitsundays on their full day tour to ‘Hardy Reef’. We started from Hamilton island and it was a 2 hour journey to hardy reef. Once at the reef , we could spend 4 hours snorkelling or enjoy other activities such …More",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.4,
  "review_count": 1923,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEuzsz2NflaaWzrzdpjxXXRaJ2hfdMsbe_mSWso6src8sz3OcWgX7v_a04giAHz5cSfJ7mKtTTk3RpCx5maLcYYPNxmFPRi4VHE_bciF8PUptywd_lqnorbiSyy0_GFg2_kQJeHpRsFM-4ww9q3IPBDLlyJhBw%3D%3D&q=Cruise+Whitsundays+Reviews&sa=X&ved=2ahUKEwj0yuTuwJ2QAxVyTmwGHQNRLG8Q0bkNegQIOBAE&biw=1907&bih=788&dpr=1.25"
}