{
  "reviews": [
    {
      "text": "I had a mixed experience with this dive tour.On the positive side, the dive masters were very friendly, professional, and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "😊Had an awesome day with Whitsunday Dive Adventures, my friend and I are really happy with the scuba diving tour! My friend is a certified diver, but I’m new to scuba, so I joined the Discover Scuba Diving tour for beginners. From the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had the best time diving with Whitsunday Dive Adventures! The crew Amber the dive instructor and Konan the dive master were super friendly and made me feel comfortable the whole way through. Everything was well organised, the gear was great, and the dive itself was unforgettable. Highly recommend if you’re in Airlie!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Just finished my PADI Open Water training today!Huge thanks to my brilliant instructor, Georgia, who guided and encouraged me …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hannah and Amber were the best instructors ever!My partner has had her first Scuba dive with Amber and she made her feel very safe and was very attentive to her needs - even though my partner had some …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We took our advanced divers course with Whitsunday Dive Adventures and it was great! Professional, educational and so fun! Georgia was an amazing instructor and we had the best time! Can’t wait to come back! Huge thank you to Georgia, Chris and Allison for 3 great days!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I’ve dived all over the world and always jump at the chance of a dive somewhere nice. Found Whitsunday Dive Adventures and got in touch. Chris was super helpful online and made everything easy. Turned up on the day. Small boat means small …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Highly recommend!We had a great time diving and snorkeling with Chris and team. The boat is well …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "My partner and I went scuba diving with Chris and Jess.I had never been diving before and was feeling really, really anxious. Jess put me at ease quickly and made me feel so safe. My partner was more confident so he …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Chris, Eunice, and Amber were absolute stars!Their shared passion for diving and dedication to making every diver’s …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "First time my wife and I dived in the ocean after getting our certification, and it was a fantastic experience. Amber (our guide) made sure we felt comfortable, checked on us throughout the dive to make sure buoyancy was accurate and pointed out some cool creatures. Great experience overall and would highly recommend!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Big thanks to Chris & Georgia as I recently completed my Open Water Diver training. Chris & Georgia created a fun, safe & professional atmosphere, which made the course & diving experience very enjoyable. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had the best time getting our PADI Open Water here! Amber was such an amazing instructor – super friendly, patient, and always explained everything so clearly. She made us feel totally at ease, no stress at all, just fun! The whole team …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Big thanks to Chris, Georgia, and Hanna. A really nice experience while doing the PADI course and the open water dives. Everyone are all extremely lovely and considerate, giving clear instructions in their teachings/instructions. They treat …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was our first time scuba diving and we couldn't have been in better hands!! The crew (Chris, Amber and Clem) made us feel safe the whole time. We went for 1 Dive (Amber was holding my hand the entire time and made sure I'm okay, as i …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We were all experienced divers, but some hadn’t dived in a while and asked for help with gear setup. No safety checks were done before the 2nd dive, which led to a serious incident when a diver’s tank detached at 5 m, made a loud boom, and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I had an amazing time with Whitsunday dive adventures. The boat, food and information was excellent, and the music! We went to 2 beautiful spots for diving and Chris took us to another one to do a bit of snorkelling with a Manta Ray! Jess …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had an incredible two-day charter with Whitsunday Dive Adventures from Airlie Beach — and can’t recommend them highly enough. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had such a great experience with Chris and Georgia. My son and I went on the 2 tank dive and the 2 dive sites selected on the day were incredible, Georgia had patience with us being newly certified and still finding our skills with …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "My thirteen year old son and I recently completed our ‘PADI Open Water Dive Course’ with Chris and the team at Whitsunday Dive Adventures. Our instructor Shelby was fantastic and very patient with us while we were learning our diving …More",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.8,
  "review_count": 218,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEvkVjFQtirYNBhM3ZJIRTaSJ6PxY6y1_6WZHGInbzDnMeEUqq2BgDZcB11Gu66hlIyZCkBjGeoAfr_5dLiVvDakujyWZ1Ip0_2xQw614m47G30KCicyUl9Rq4ujDF1L_aHgYhJoo1H_ejfBr8rhqLaCgPaINQ%3D%3D&q=Whitsunday+Dive+Adventures+Reviews&sa=X&ved=2ahUKEwj1yd2Nwp2QAxWncGwGHa0BMawQ0bkNegQIPBAE&biw=1536&bih=730&dpr=1.25"
}