{
  "overall_rating": 5,
  "review_count": 7,
  "reviews": [
    {
      "author": "Customer",
      "rating": 5,
      "text": "Absolutely joyful day with the passionate kid sam who explain every step of the way, guide and entertain Kai with his Ukulele, and with Dans delicious BBQ lunch and voyage... Love the family business and how much dedication to make the guests day filled with happy and wonderful memories.."
    },
    {
      "author": "Michael Stuhldreier-Christ",
      "rating": 5,
      "text": "Great trip! Very friendly crew with many stories to tell, great BBQ at the beach and the views are just wow. Highly recommended!"
    },
    {
      "author": "Julie Duckworth",
      "rating": 5,
      "text": "Had a fantastic day with Whitehaven Express. Captain Dan, Crew Dan and Jess were wonderful so laidback, friendly and professional. Had a great BBQ lunch and an amazing trip and walk to Hill Inlet. What an amazing view. Incredible. Would highly recommend this tour."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Brilliant! We're so glad to hear your trip with us went so well and that your steak was cookedperfectly :) Thanks for leaving us a review."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "What is the best Whitehaven Beach tour?The Whitsunday Bulletis one of the best Whitehaven day tours in Airlie Beach! The speedy catamaran whisks guests off to the most stunning spots in and around Whitsunday Island in no time at all - including both the north and south end of Whitehaven Beach.Which Tours Go To South Whitehaven Beach? - Sailing WhitsundaysSailing Whitsundayshttps://sailing-whitsundays.com› article › which-tours-g...Sailing Whitsundayshttps://sailing-whitsundays.com› article › which-tours-g..."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "The Whitsunday Bulletis one of the best Whitehaven day tours in Airlie Beach! The speedy catamaran whisks guests off to the most stunning spots in and around Whitsunday Island in no time at all - including both the north and south end of Whitehaven Beach."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "One of the top beaches in the world and not to be missed.Absolutely worth it if you go via Ocean Rafting Hamilton Islandas the journey there and snorkeling stop and Betty's Beach and the inlet lookout are also included. Best day of my life. Had my 60th birthday on Whitehaven beach, perfect 👌 then Bommies for dinner .5 Oct 2025"
    }
  ],
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=2233a96e66cd7b17&si=AL3DRZHrmvnFAVQPOO2Bzhf8AX9KZZ6raUI_dT7DG_z0kV2_xyVQy_tTvI_Sbd0-bpmqROGIAPKUphokeKanhLNOe4h-iQDxkm-EMKfrsZwDGHNBpy5ClIJgFUg3hYzhH3z7Ht1Peou7sAyR0jGXC-Ff2hv4AB65ExVlKmiiNvOW6Todq_g3Jis%3D&q=Whitehaven+Xpress+%7C+Whitehaven+Beach+Tour+Reviews&sa=X&ved=2ahUKEwjLkLnYxqaSAxUrslYBHf7xI_IQ0bkNegQIRxAH&biw=1536&bih=730&dpr=1.25&aic=0"
}