{
  "reviews": [
    {
      "text": "Such an awesome day on the water. Got to bring my underwater housing and learn some more tricks in underwater photography. The instructors were super friendly and full of knowledge!! Can't wait to come back for more dives with them. Thanks!!",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "Did my PADI open water diver course with Annie and couldn't have hoped for a better place to do it. Did 2 shore dives at Bowen beach and then 2 boat dives off the coast of the whitsunday islands so you get to experience everything as part of the course. Annie is an incredible instructor with tons of experience, very organised and professional. Definitely will be coming back for the more advanced courses and highly recommended for any diver of any level 👌",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "Open water scuba course is a must do if you have 3 days in Airlie! Annie ran our course and exceeded our expectations completely, her approach to learning was tailored to the individual and practical. The course was always enjoyable and an unforgettable experience thanks to Annie. She knows her stuff and made us feel really comfortable in the water. Will definitely be back for the advanced open water course, thank you Annie!",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "I had an incredible experience with Annika, I was a very last minute booking for joining in with some fun dives she had going out the next day and she managed to fit me in. It was my first time diving in some time and I was made to feel at ease with her knowledge and professionalism. She along with the skipper Peter know the area very well which allowed us to see an incredible array of marine life including coral reef that I saw made it well worth it. I was also fortunate enough to join in the next day for the SS Yongala wreck dive and again it was an incredible experience which I would highly recommend, it was my first deep dive and I had such fun and felt completely at ease with the whole experience, if you're in the area I would highly recommend visiting Annika for an diving you're planning on doing",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "We had such an amazing time diving with Annie. She was really flexible and added our sunrise dive even though she already had a trip planed that day. It was truly incredible! Both of our dives were perfect and we would recommend it to everybody! Also a big thanks to our amazing skipper!",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "The best experience with Annie as my dive instructor for open water. My first time diving and I felt very comfortable. We saw a lot of Marine wildlife (turtles, reef sharks, rays, tropical fish). Weather perfect too. Highly recommend and very grateful, now I'm hooked on diving! Thank you so much",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "Had a fantastic time doing a PADI open water scuba diving course with Annika. She is an excellent instructor and the groups are small enough that you get a lot of support. The Whitsundays are a beautiful spot to learn to dive, there are so many corals and fish to see while learning. Highly recommend for anyone visiting Airlie Beach.",
      "author": "Google User",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.8,
  "review_count": 102,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?q=Airlie+Beach+Diving+Airlie+Beach+reviews"
}