{
  "reviews": [
    {
      "text": "Reece was our guide and omg the tour was outstanding we loved it that much we returned the next day. The sunset was spectacular and the guide Reece gave us so many opportunities to take great photos (shout out to the great photographer Reece)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We booked the jet ski tour in the afternoon and had Destiny as our guide. She was amazing very clear in her explanations and always making sure we had the best experience. Within the first 20 minutes, we saw whales, and thanks to her, we …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had an absolute blast! Chris was lovely and explained the rules and jetski driving instructions calmly and clearly.We got lucky and had the perfect day and even got to see whales! I couldn't recommend this activity enough!!!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Best Valentines Day on the water with Ocean Dynamics. My finance and I took the the jet skis from Airlie to Daydream Island on a guided tour. This  is the only way to spend time on Daydream Island without being a resort guest. We were the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Unreal experience! Racing JetSki’s up and down Airlie Beach water front and Coral Sea Marina. Destiny our tour guide even pointed out some Turtles and we saw Dolphins!!! Must do if you’re spending sometime here in Airlie.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Up in the WhitSundays with my extended family and had the opportunity to go out again on the Ocean Dynamics Sunset Cruise from Daydream Island. What a fabulous experience. A stunning boat, that rides the ocean comfortably around the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I did the jet ski tour with guide Chris and it was amazing. The views are spectacular, we even saw jumping whales! The guide is very well informed and the breakdown at the beginning is great so first timers can feel really comfortable on the jet skis",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an amazing JetSki tour.We had the best experience with our amazing guide Destiny.As a first timer on a JetSki Destiny made us feel comfortable right from the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Kicked off the day with an amazing jet ski ride with Ocean Dynamics!Our guide was Destiny …she was awesome!!Destiny was great she explained all the rules & was very patient with us all. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Took a Jet Ski tour from Airlie Beach with your guide Chris. It was a fantastic day and Chris took us around a couple of the Whitsunday Islands which was a special experience. We also saw some dolphins and Chris shared his knowledge of the islands and area. Thanks for a great tour.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Jet Ski Tour - Such a great experience! Super personal and well run. From the fantastic introduction on shore to Chris guiding the tour. Amazing experience would definitely recommend to everyone. Worth the money for sure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi KianaThank you very much for your review - we are glad you had an amazing time!  Hope to see you back next time you are in the beautiful Whitsundays!Carolyn LewisOwner",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I've done JetSki tours all over the world, and this one was by far the best! The equipment was brand new, the location was absolutely stunning, and the entire team — including the lovely owner — went above and beyond to make the experience unforgettable. Highly recommend!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks Ocean Dynamics Tour for a thrilling and exciting jet ski tour. Chris, our instructor, was very informative, helpful and friendly. The scenery was breathtaking. Thank you for offering this tour privately even when a cruise ship was in for the day.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing experience.Stopped in at Airlie beach on a carnival cruise. And took the opportunity to go on the JetSki safari from ocean dynamics. Could not be happier with the tour seen whole bunch of the islands along with a few wales jumping and splashing",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "OMG we had the BEST time!!! My husband and I shared a JetSki and we were lucky to be the only ones on the tour. Jess was so lovely and made our day extra fun!! It was our first time JetSkiing and we will definitely do it again.Thank you so much Jess! 😊",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.4,
  "review_count": 128,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-ExkWnvgOh4xLw9VVamHhfupT-GNqppW7iN3sPlj1Ia72_ghlTRIeOJ406NozgmLg5rUa2YaqeAchlTSHLvZz5CbbmHwC5SzJXZwG195pnGGX4BtqH3htrwto69COnYs5BV22brk%3D&q=Ocean+Dynamics+Tour+Bookings+%26+Private+Charters+Reviews&sa=X&ved=2ahUKEwjM3JzqwZ2QAxXFXWwGHZdmLMkQ0bkNegQIPRAE&biw=1536&bih=730&dpr=1.25"
}