{
  "reviews": [
    {
      "text": "Best company in Whitsunday to spot turtles ethically. We saw about 7 very close to the kayak. Would recommend",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had a fantastic hour and a half paddling around Pigeon Island. Beautiful clear water and had about 10 turtles poke their heads up to say hi. Mark was very friendly, helpful and informative. Is definitely something we would do again the next time we visit Airlie Beach. Thanks Mark for such a lovely experience.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing experience. Saw 2 types of turtles.  Friendly and knowledgeable staff.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We went out from Shingley Beach with 2 adults and 2 kids (2 X double kayaks) and had the best experience! We saw so many turtles and the operator was super friendly and knowledgeable.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Had a wonderful time this morning! Mark was so informative and lovely. We got to see turtles as well! Definitely recommend!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing experience kayaking today , mark was super friendly and we even got to see turtles, highly recommend to anyone living or visiting Airlie :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Must do experience in Airlie beach. Professional host with easy to follow instructions. I was a first timer - so easy, and it’s great fun. Worth the money. Highly recommended.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Friendly and very helpful operators. My family and I were able to take out two Kayaks on the recommended route along the coast to a nearby beach. We experienced seeing many turtles up close making it totally worthwhile. Equipment was all good, would do this again !",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "A great kayak tour with a great bloke. Mark is so knowledgeable. We had great fun and will recommend.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had a great family morning out on the kayaks. Conditions were pretty much perfect and we were fortunate enough to see 3 different sea turtles. The customer service was great, with sound advice given to us to navigate to the best spot/s to see the turtles. Highly recommend this for a family activity with older kids.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Couldn't have been easier hiring a couple of double kayaks to explore the bay with our two young kids. Super stable kayaks, and great tips given to us meant we were able to spot loads of turtles! Lovely morning on the water.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Mark was very accommodating and helpful. We had a wonderful experience sighting 3 turtles and a stingray. Highly recommend and we will be returning.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We went on a tour with kayaks leading up and down the coastline of Airlie beach. Turtles were shy today, but it was still great fun. The team guided us to several places where the animals live and eventually a beautiful big turtle surfaced just next to us. Team was great, we enjoyed the trip a lot!!!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Lovely time on self guided Kayak your from Shingly Beach. Mark recommended some good routes where we might see local wildlife, we had a great paddle around pigeon island & the mangroves, and the highlight of the trip was spotting a Dugong! ...thank you Mark!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Really friendly service from the instructor Mark. We saw 4 turtles and a manta ray on the reccomended route - amazing value for money!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I'd never been on a stand up paddle board before, and I've just spent 2 hours on one. Old mate was great to deal with, instructions given were easy to follow, there were even a couple of complementary photos taken and supplied. I thought this was excellent value for money way to spend a couple of hours out on the water.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "10/10 recommend Mark and his fantastic service. As a group we have gone both kayaking and paddle boarding, and had a great day out both times!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Stand Up Paddle and Kayak | Airlie Beach QLDFacebook · Whitsunday Stand Up Paddle and Kayak4.7K+ followersFacebook · Whitsunday Stand Up Paddle and Kayak4.7K+ followers",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Whitsunday Stand Up Paddle and Kayak | Airlie Beach QLDFacebook · Whitsunday Stand Up Paddle and Kayak4.7K+ followers",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.9,
  "review_count": 36,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=c3fe999626797709&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-EybsGFEb-svTM088k5gRfx0zAksmmpBaZVuUZj8EjsoPd4WeCenptyuwmLpPsNbwlEVVH0tnTTzXg79oBga5tQNOur2JT1GnDZBjPezxdA9LwWt4KvVd4hiaqPEvOAkB_y1gUHY%3D&q=Whitsunday+Stand+Up+Paddle+%26+Kayak+Reviews&sa=X&ved=2ahUKEwi616jKubmQAxWRqFYBHSDLI4oQ0bkNegQIOBAE&biw=1907&bih=788&dpr=1.25"
}