{
  "overall_rating": 5,
  "review_count": 12,
  "reviews": [
    {
      "author": "Victoria Keevers",
      "rating": 5,
      "text": "Absolutely incredible! Justin was great and the whole experience was just fantastic. We had beautiful weather and amazing views, I highly recommend going with Airlie Beach Helicopters 😄"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "What an amazing experience, Justin was funny and knowledgeable. I Love that its a family run business. We flew around heart reef and got to spend a bit of time on Whitehaven beach.  Thankyou Justin and tabs for a great arvo !"
    },
    {
      "author": "Kylie Keeling",
      "rating": 5,
      "text": "This is the most amazing experience. Everything from the very beginning to the final drop off was 5 Star. Justin has set up a magnificent personalised service. Would highly recommend"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "An absolute must ! An incredible experience. The price is really worth it! Thank you for this wonderful time !!"
    },
    {
      "author": "Suzanne Dutton",
      "rating": 5,
      "text": "Fantastic experience flying with Justin today - magical tour of the Whitsundays with Justin telling us some history and island facts, delivered in a friendly manner.  Beautiful scenery - highly recommend.Lovely to meet your wife too!"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Justin took myself and my wife up today for the Reef & Whitehaven spectacular. Spectacular is definitely the word for it. This with Justin's knowledge of the area and local knowledge make for an unbeatable experience,  make sure to ask for his local dining suggestions"
    },
    {
      "author": "Kim Partridge",
      "rating": 5,
      "text": "Had the best trip, great info and service from Jason , magic destination 👍🏻🚁❤️"
    },
    {
      "author": "Nigel Ruck",
      "rating": 5,
      "text": "Just to say if you’re going to do anything at Airlie beach make sure you go with this guy,well worth it awesome thanks Nigel and Helen 😄"
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Had a great time and the pilot was friendly and gave us great experience. Would definitely recommend. Would think of using this organisation as everyone in the ...Read more"
    },
    {
      "author": "Unique Views:",
      "rating": 5,
      "text": "Offers bird's-eye vistas and angles impossible to get from the ground, revealing the true scale and beauty of landscapes, reefs, or cities."
    },
    {
      "author": "Customer",
      "rating": 5,
      "text": "Allows you to cover vast areas quickly, ideal for travelers with limited time to see places like the Great Barrier Reef or remote wilderness."
    },
    {
      "author": "Thrilling & Memorable:",
      "rating": 5,
      "text": "Thrilling & Memorable:The experience itself is exciting, from takeoff to the unique perspective, creating a highlight for many trips, notesBLADE."
    }
  ],
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=2233a96e66cd7b17&si=AL3DRZEsmMGCryMMFSHJ3StBhOdZ2-6yYkXd_doETEE1OR-qOWhOlc3PsWspd7zStTN30wQiOZXH2rt-xaKvwnNnPlDtaln2otf6Qy-cEY6qwvsgXZqDHLroDABIKHqn4XdpT5V1Mu5sAyDLi3E4Tv-HSY4S7xEQuQ%3D%3D&q=Airlie+Beach+Helicopters+Reviews&sa=X&ved=2ahUKEwjxwoTGxaaSAxX0slYBHS-LE_YQ0bkNegQIORAH&biw=1536&bih=730&dpr=1.25&aic=0"
}