{
  "reviews": [
    {
      "text": "Beautiful evening spent sailing into the sunset. Very relaxing and felt totally safe. Crew did an amazing job. Would recommend this to everyone. Wonderful way to spend our last night here in Airlie Beach",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "The Getaway 3D/3N tour was amazing! We saw turtles, dolphins and stingray, others snorkelled the reef but that was not my thing. We visited a number of beaches and lookouts and saw stunning views. We were predicted rain and had a little but this did not spoil the experience. Our Captain (Andreous) knowledge of the area helped us find the best spots. We had a great sleeping experience in our private cabin with en suite bathroom. The food was also exceptional and we were pleasantly surprised with the quality and portions given - thankyou Phoebe. Andreous and Phoebe were amazing hosts and we can't thank them enough for an awesome experience. 10/10 would do again and highly recommend the experience.",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "Best part of our honeymoon! We were lucky enough to have 3 weeks travelling Bali, Australia and Fiji for our honeymoon and the 3 nights/days spent on the Whitsundays Pearl was by far the highlight. We were apprehensive about the other guests but there was the perfect mix of ages and all very likeminded - some of those we will definitely stay in contact with. Mark our Captain and Ella our host, were both fantastic in every way. Mark perfectly adapted the trip based on the conditions which made it feel very bespoke. Ella never let us get hungry and kept the boat running smoothly all trip. Our snorkelling trip to Cataran Bay was unbelievable and our evening spent on Whitehaven beach was probably the standout for us - not to mention spotting a humpback Whale and its calf leisurely swimming alongside the boat about an hour into the trip (End of August). Lastly, the food Ella cooked was genuinely the perfect home cooking (not forgetting Mark on the Barbie) huge portions and extremely fresh. She also catered perfectly to a couple of pescatarians on the boat. Overall, we thought it was excellent value for money and we will definitely be back, hopefully in the not so distant future! Josh & Holly",
      "author": "Josh & Holly",
      "rating": 5.0
    },
    {
      "text": "An unforgettable sailing experience! Our 3-day cruise on the Solway Lass was simply magical. The ship itself is full of character and history, which made the adventure feel truly unique. Waking up to the sunrise on the ocean, snorkeling in crystal-clear waters, watching the stars from the deck at night — it was like stepping into a dream. But beyond the beauty and serenity, it was also non-stop fun! We jumped off the ship using the swing rope, floated around in an ocean pool, tried paddleboarding, and laughed endlessly with the crew and other guests. Every day brought new adventures and so much energy. The crew was absolutely fantastic: friendly, professional, and always making sure everyone was having the best time. The food exceeded all expectations, and the vibe on board was relaxed, open, and full of good vibes. We met amazing people from all over the world. This wasn't just a tour, it was a real experience. If you're looking for something authentic, beautiful, and filled with soul (and a good dose of fun!), the Solway Lass is it.",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "We had the most glorious day on SV Summer Jo, Dan and his crew were excellent. The day was the perfect combination of chill, adventure and picture postcard scenery. Thank you for making our trip to Whitehaven Beach and the Whitsundays one to remember.",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "The Solway Lass was an unbelievable experience. The boat had bunks for everyone and it was so cool to be on a piece of history. The crew was friendly and served us better than expected food. You cannot beat the whitsunday views. Hoping to go again very soon!",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "What an amazing cruise! A dream come true for us. Rooms are surprisingly spacious and comfortable given the size of the boat, each with an ensuite. Food was exceptional! Plenty of it,homecooked meals each night. Staff were great- friendly, helpful and professional. And the views and experiences were amazing. Totally recommend.",
      "author": "Google User",
      "rating": 5.0
    },
    {
      "text": "We did an overnight trip with Siska and we had overall a nice time. It's a great way to meet people, the size of the group (around 20 guests) feel not too big, the staff was friendly and the 2 stops on 2 sides of Whitehaven beach were so beautiful. We also felt like few details could have make us appreciate our trip more like knowing more about the whitsundays in general from the crew, having also more info about what was going before each stop. It could be better to take some snacks with you as you can have long break without any food. About the snorkeling part the visibility wasn't great but maybe we were unlucky with the weather conditions this day.",
      "author": "Google User",
      "rating": 3.0
    }
  ],
  "overall_rating": 4.3,
  "review_count": 373,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?q=Explore+Whitsundays+Airlie+Beach+reviews"
}