{
  "reviews": [
    {
      "text": "My partner & I did the 1 hour plane flight over The Whitsundays  & out to Heart Reef - was perfect weather! Our pilot Max made this trip more awesome! What a magical day! We absolutely loved every minute of it!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Just want to say a massive thanks to Darcy (the pilot) and the team for making our engagement so special! It was an unreal experience that was worth the money!We did have a problem that we had accidentally booked it on Hamilton Island not …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Awesome experience!We did the 1 hour airplane tour and it was just incredible.We saw the beautiful whitheaven beach from the sky and the reef which was …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had a wonderful experience.We felt welcome and had a nice chat with Clare, the lady at the front desk.Our pilot, Tom, was really friendly and 'happy'! We did the 1h tour to Hill …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Loved our time flying with HeliReef for our elopement on Whitehaven Beach. Pilots were warm & welcoming. One of them was our witness so thank you so much for that ☺️🤩 you're amazing! …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing once in a lifetime experience. We did the 20 minute tour over the islands and the reef, it’s was beautiful. Our pilot, Flynn, was very friendly and talked us through the whole journey. Wish we had booked a longer tour to see the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Absolutely fantastic experience.My misses and 3 year old daughter loved it.The pilots are fantastic with so much knowledge of the area.We loved it so much we had to do another flight the following day.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had a wonderful heli trip to Whitsunday, very good pilot an an amazing time there. The service was from the beginning super friendly and professional - thank you all😀",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Once in a lifetime experience! Ben was a great pilot and guide. He spotted many things for us and me and my girlfriend got to see a breaching whale for the first time!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We found their location very easily in arlie beach marina The lady who welcomed us was super lovely. We were shown the safety video and within minutes we were shown out to the marina where the pilot Justin and the helicopter were waiting to …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Tim was a great pilot! we got to see a couple of whales on our way to the Great barrier reef. The reef itself was sublime and a big tick off my bucket list!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was my experience when asking for information that the Australian Civil Aviation Safety Authority recommends on their website.Hello, I am an American tourist considering taking a tour with your company.  I …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had the most amazing experience with heli reef , Darci our Pilot definitely went above and beyond to make this a day, well never forget ... couldn't recommend more.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an experience 🙌... Christian our pilot was absolutely amazing. Wealth of knowledge,  friendly,  caring and super professional. Could not recommend this more highly.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Fantastic ride with great conversations and information! Saw the next parts of the reef during our 1-hour heli ride. Highly recommend the 1-hour for a good ride!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "What an awesome experience. Enjoyed a 20 minute thrill ride with Ben, great pilot and great Bloke. Thank you, would recommend to anyone",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Stunning views 🤩 Christian was an amazing pilot 🙂thank you",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "I recently had the most incredible experience on a helicopter tour with Darcy, and I can’t recommend it enough! From the moment we took off, the views were absolutely breathtaking—nothing can compare to seeing the landscape from that …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We did the Whitehaven Beach Escape tour on the helicopter and it was a highlight of our trip to Australia.  We went in April on a Saturday afternoon and when we landed on the beach, there was only one other helicopter about 500m away and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was the best thing we did in Airlie. My GF and I went on a flight over heart reef and landed at Whitehaven and went for a swim. To see the reef from above was incredible. Expensive, but worth it.",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.7,
  "review_count": 39,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E4HRnpSqsJsUYCoMRZmC7uxJqfxmP7pj6Bv_rFFE5j27rRRXIJYyfwH3fJ20Jq4RlGfTkwtVV443GJw7Sr7Ece4vB6TUyY-cVgcBNGjPYRHl8_CTL7FoawQU-80M2yBBEYyK5RA%3D&q=HeliReef-+Coral+Sea+Marina%7CResort+Reviews&sa=X&ved=2ahUKEwjS8aKywZ2QAxUkUGwGHd_zFNwQ0bkNegQIPxAE&biw=1907&bih=788&dpr=1.25"
}