{
  "reviews": [
    {
      "text": "Went on the glass bottom boat cruise. The bus driver was friendly, the team great on the cruise. Plenty of fish and coral to see. No bonus dolphins, turtles or whales. Cruise was advertised as 70 mins, we were back in dock at 50 mins. Otherwise a great experience.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Lito, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Lito, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks to Alex for a  great experience. We had the best fun on the jet boat ride, he had the tunes pumping and also provided some interesting facts about the turtles etc just outside of the Airlie harbour. 10/10 Will do this again when we return next year with the whole extended family.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We went out on the Airlie beach jet boat thrill ride. PK was our skipper, top bloke who delivered a 5 star experience.Would definitely go again",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Rob and Di, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass on your comments to Bo. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Rob and Di, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass on your comments to Bo. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Fantastic trip.  Boat was not over crowded at all, there is also a bar and toilets available on board.  Great view of the coral, plenty of fish and even a turtle.  Highly recommend this tour for all ages.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Sharon, Thank you for your amazing review! We appreciate you taking the time to share your feedback and we will pass the comments onto the crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Sharon, Thank you for your amazing review! We appreciate you taking the time to share your feedback and we will pass the comments onto the crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Loved our 70 minute trip on the glass bottom boat. Saw fabulous types of coral and some fish too. Really friendly and knowledgeable staff.  Highly recommend this trip as suitable for all ages.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Bianca, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Glass bottom boat crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Bianca, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Glass bottom boat crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Amy, Thank you for your amazing review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Alex. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Amy, Thank you for your amazing review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Alex. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Amazing sunset cruise on the Glass Bottom Boat.  Very friendly, helpful and informative staff.  Watching the sunset while enjoying a glass of bubbly and nibbles was the highlight.  Loved the corals and even glimpsed a turtle.s",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Lyn, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Glass bottom boat crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Lyn, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Glass bottom boat crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We really enjoyed this activity as a first view of the reef. The staff were very knowledgeable about the wildlife and the reef itself and we learned a lot. It was a fun and relaxing activity.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Pioneer Adventures (owner)a month agoHi Wendy, Thank you for your amazing 5-star review! We appreciate you taking the time to share your feedback and we will pass the comments onto the Glass bottom boat crew. We hope to welcome you aboard again soon for another unforgettable adventure!",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.6,
  "review_count": 264,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=f0ead55d09cdc2fd&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E2EnHENGOYLC9fM9y16r7T4frxSE2ivLJlJA4hME5--5xUmyTKe0RYmT7Lz0n5-Kci7mu41GCx1w6NT5ct0n11LUr7-YGpomqJAkCw9nmQdLRUfu5A%3D%3D&q=Pioneer+Adventures+Reviews&sa=X&ved=2ahUKEwjFgNfyn7qQAxU1h68BHZpzFzkQ0bkNegQIShAD&biw=1907&bih=788&dpr=1.25"
}