{
  "reviews": [
    {
      "text": "Went on the glass bottom boat cruise. The bus driver was friendly, the team great on the cruise. Plenty of fish and coral to see. No bonus dolphins, turtles or whales. Cruise was advertised as 70 mins, we were back in dock at 50 mins. Otherwise a great experience.",
      "author": "Lesley Nolan",
      "rating": 5.0
    },
    {
      "text": "Thank you. We truly had the best time on your tour. The crew was awesome and very knowledgeable. What a brilliant combination of watching the coral and the life underwater and a stunning sunset at the same time. We can highly recommend this tour.",
      "author": "Kerstin Altmann",
      "rating": 5.0
    },
    {
      "text": "Did the glass bottom boat tour with matt and craig, awesome experience! both were very informative about the coral and sea life and answered every question we threw at them, great experience and our whole group were very satisfied. couldn’t recommend it more.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks to Alex for a  great experience. We had the best fun on the jet boat ride, he had the tunes pumping and also provided some interesting facts about the turtles etc just outside of the Airlie harbour. 10/10 Will do this again when we return next year with the whole extended family.",
      "author": "Amanda Archer",
      "rating": 5.0
    },
    {
      "text": "Just had a vip experience with Brendon this afternoon from jet ski tour at daydream island, totally beyond my expectations, the best adventure I had over the years. Thanks!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We went out on the Airlie beach jet boat thrill ride. PK was our skipper, top bloke who delivered a 5 star experience.Would definitely go again",
      "author": "Jaydon Newton",
      "rating": 5.0
    },
    {
      "text": "We went on the Jet boat thrill ride with PK today, he was made for the job! We had a great time and he made sure everyone had a smile on their face. Highly recommend and would do again!",
      "author": "Shani Toye",
      "rating": 5.0
    },
    {
      "text": "We had the best time, so much fun. Professional, genuine and our driver made the experience one to remember. Thanks PK and pioneer adventurers for our Airlie beach memories.",
      "author": "Rachael Dobson",
      "rating": 5.0
    },
    {
      "text": "Efficient pick up from hotel, safe comfortable glass bottom boat.Friendly staff and informative tour of Coral reefs. Viewed many different varieties of coral and fish. Included fish feeding with pellets. Although the duration was only 70 minutes this was reasonable value for $89.",
      "author": "David Westwood",
      "rating": 5.0
    },
    {
      "text": "This tour was perfect, we saw lots of fish and coral and even some turtles! The crew were friendly and it was very well run",
      "author": "Hannah Edwards",
      "rating": 5.0
    },
    {
      "text": "Hi Margaret, Thank you for sharing your feedback, both positive and constructive. I apologise that we did not meet your expectations. We have taken your comments on board and we hope that you will come back out with us again!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Wonderful experience!! We went on a JetSki tour, Brendan our guide was fantastic! Friendly,  full of knowledge and looked after us! Thank you",
      "author": "Maria Prinsloo",
      "rating": 5.0
    },
    {
      "text": "Fantastic trip.  Boat was not over crowded at all, there is also a bar and toilets available on board.  Great view of the coral, plenty of fish and even a turtle.  Highly recommend this tour for all ages.",
      "author": "Alison Keenan",
      "rating": 5.0
    },
    {
      "text": "Complimentary pick up and return to hotel (certain hotels only), friendly staff with informative commentary and interesting and enjoyable view of the coral and other sea life.  Great for older people and kids.",
      "author": "Bel S",
      "rating": 5.0
    },
    {
      "text": "Had an awesome time on the 30 minutes Jet Boat thrill ride! The skipper was heaps of fun and made the experience great.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We’re thrilled you loved the glass bottom boat tour. It’s always a joy sharing the underwater world with awesome guests like you. Hope to see you back on board for another adventure soon!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi Rebecca, Thank you for leaving us a 5 star review. We are stoked to hear you and the whole family had a great time on our glass bottom boat. We look forward to seeing you again soon :)",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "If you want an exhilarating boat ride, then look up Alex and his 800hp jet boat in Airlie Beach, you will not be disappointed. He uses all of its hp for your pleasure especially when he throws it into a 360 turn. It is one boat ride that everybody should do at least once in their lifetime. Great stuff.",
      "author": "Noel Hendrickson",
      "rating": 5.0
    },
    {
      "text": "Loved our 70 minute trip on the glass bottom boat. Saw fabulous types of coral and some fish too. Really friendly and knowledgeable staff.  Highly recommend this trip as suitable for all ages.",
      "author": "Bianca Cooke",
      "rating": 5.0
    },
    {
      "text": "Fun jetboat ride for the whole family. Decent time too unlike some that last for only 10 mins. The driver we had was good too. Worth doing if you’re looking for something to do in Airlie with the family",
      "author": "Shannon Lamberton",
      "rating": 5.0
    }
  ],
  "overall_rating": 0,
  "review_count": 0,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=2233a96e66cd7b17&si=AL3DRZEsmMGCryMMFSHJ3StBhOdZ2-6yYkXd_doETEE1OR-qOeAx-9-fRpN6CNswL40KL0lIsX4HVlVO3r_9KkVLK8jqRy4mBnE-UnaljNpFSEqF2-uLKWmmrrKqNkPZgHscFMASx_UrQyZ7dsiLjX6HMWBJnqdHkg%3D%3D&q=Pioneer+Adventures+Reviews&sa=X&ved=2ahUKEwjnj_DoxaaSAxW6sFYBHWDyIPoQ0bkNegQIOxAF&biw=1536&bih=730&dpr=1.25&aic=0"
}