{
  "reviews": [
    {
      "text": "This was an absolutely unforgettable evening! The sunset cruise exceeded all our expectations – breathtaking views and calm waters created a truly magical atmosphere. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This cruise was really amazing and we really enjoyed it. At first we thought 2hours was too long, but with some music and a glass of bubbly it made it a fun and enjoyable experience. The night rolled on, we enjoyed the happy snaps, …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "A very enjoyable day which included two snorkelling spots with colourful fish and plenty of time on Whitehaven Beach add well as the lookout which has a stunning view. They were able to accommodate my vegetarian meal request and we had a …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "We had an amazing time on the sunset cruise with Sundowner Cruises! The vibe was fantastic — not overcrowded at all, which made it feel really relaxed and enjoyable. The staff were pleasant and friendly, and the music set the perfect mood. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Sundowner Cruises | Iconic Whitsunday Adventures (owner)4 months agoBeautiful photos Julia! Thanks so much for sharing. We're very thankful for your lovely, details review, you've summarised our sunset cruise so nicely. Hope you'll come again some time!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Beautiful photos Julia! Thanks so much for sharing. We're very thankful for your lovely, details review, you've summarised our sunset cruise so nicely. Hope you'll come again some time!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "The gentleman who run this cruise are absolutely amazing and make you feel incredibly welcome from the moment you step on the boat to leaving, I would personally do this part of the package again. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Sundowner Cruises | Iconic Whitsunday Adventures (owner)4 months agoHi RiverWe are very sorry you have had this experience with our partner restaurant, as this is very out of the ordinary. Grateful for the good review of our Sundowner Cruise, where we consistently deliver great experiences!I can confirm that we definitely did book the restaurant for you, but that at the time the restaurant had changed booking systems and there were some teething problems. We will definitely discuss this whole issue with them, as we know that the owners and managers would not want their guests to feel this way.We do hope you'll give them and us another chance, next time you are visiting Airlie Beach.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Hi RiverWe are very sorry you have had this experience with our partner restaurant, as this is very out of the ordinary. Grateful for the good review of our Sundowner Cruise, where we consistently deliver great experiences!I can confirm that we definitely did book the restaurant for you, but that at the time the restaurant had changed booking systems and there were some teething problems. We will definitely discuss this whole issue with them, as we know that the owners and managers would not want their guests to feel this way.We do hope you'll give them and us another chance, next time you are visiting Airlie Beach.",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Absolutely perfect afternoon, we saw sea turtles, the staff are great, music, nibbles & bubbly & lovely cruising gently around the Gorgeous waters.. I highly recommend choosing this sunset cruise- the best time I've had in a long time. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "My partner and I did the cruise and dine option - Beautiful scenery through the whole cruise, the nibbles were perfect to have before we headed to Sorrentos for dinner. The food was amazing! The views from upstairs watching the last of the …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Sundowner Cruises | Iconic Whitsunday Adventures (owner)6 months agoThanks Heather! Our Cruise & Dine package with Sorrento's Restaurant at the marina is a great option for a special evening, or just because. The food is always great, and it's good value too!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks Heather! Our Cruise & Dine package with Sorrento's Restaurant at the marina is a great option for a special evening, or just because. The food is always great, and it's good value too!",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Lovely boat, great selection of drinks, crew and skipper were lovely. Extra points to the funny bloke  doing the rundown/safety briefing who organised everyone to sing happy birthday to my Bestie and the lovely girl having the hen’s party …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Sundowner Cruises | Iconic Whitsunday Adventures (owner)4 months agoThanks Jade! Love it. Our people make the trip what it is, no matter if its cloudy or sunny, but we especially love it when e make new friends like this! Happy birthday to your bestie",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Thanks Jade! Love it. Our people make the trip what it is, no matter if its cloudy or sunny, but we especially love it when e make new friends like this! Happy birthday to your bestie",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Cruise was great, lots of seating, staff were friendly and fun. Snacks and drinks were also good. …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Unfortunately it was a very overcast evening when we went on this cruise so no spectacular sunset. We saw some turtles. Welcomed with a. glass of bubbly. The 'snacks' were one tray with 1 dip, biscuits and veggie sticks left on the bar for …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "This was a great little evening tour. The sunset was beautiful, the music relaxing which set off a great vibe & the staff were friendly. Lots of options to purchase drinks on board which is great as beer and wine doesn’t suit everyone and …More",
      "author": "Customer",
      "rating": 5.0
    },
    {
      "text": "Six of us had a ball on the sunset cruise!Champagne on arrival, nibblies, smooth sailing and the sunset was incredible.We would recommend this as a ‘must’ in Airlie Beach.10/10",
      "author": "Customer",
      "rating": 5.0
    }
  ],
  "overall_rating": 4.6,
  "review_count": 193,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/search?sca_esv=b93990c6e247b7c1&si=AMgyJEtREmoPL4P1I5IDCfuA8gybfVI2d5Uj7QMwYCZHKDZ-E4vIdCGUwUHASXcfwbJrUlh17MSEb-Lq0KPynfPuOkXNj-wokm9uzW-q3vNanJ4xqxdlH0nxCeE7vp4RO1b7TvsHguX-m_ab4bEyWG2jDsl-fkYEEoZDGjg5G-DKfRKbS3lIEkLe21DTZZj4J6AwQTd5osnc&q=Sundowner+Cruises+%7C+Iconic+Whitsunday+Adventures+Reviews&sa=X&ved=2ahUKEwiamIOAwp2QAxUYd2wGHaHuBmoQ0bkNegQIPRAE&biw=1536&bih=730&dpr=1.25"
}