{
  "reviews": [
    {
      "rating": 5.0,
      "title": "Incredible experience aboard The Wings III!",
      "text": "What an incredible experience aboard The Wings III! The ladies on board were so cheerful, welcoming, and friendly – they really made the day feel special. The food was delicious, and the whole tour was absolutely stunning. We saw so many turtles!\n\nWe visited Hook Island, and the clear kayaks were such a fun and unique way to explore. The boat itself was spacious and incredibly comfortable – cruising softly through the Whitsundays felt like pure luxury. It was the perfect day.\n\nThis tour was ideal for adults and older children, as it's a bit of a longer ride to the outer reef, but we chose this spot specifically as we wanted to snorkel and it was more than worth it. The journey itself was so smooth and relaxing.\n\nThe crew really went out of their way to look after the families onboard and make sure they were comfortable. They have a little inflatble boat to jet around those with mobility issues so you don't have to snorkel or kayak to enjoy the day.\n\nHighly recommend – such a magical way to experience the Whitsundays! And probably the nicest boat we saw out there!",
      "author": "Emma T",
      "date": "Recent",
      "visited": "Weekday"
    },
    {
      "rating": 5.0,
      "title": "Perfect for first-time snorkelers",
      "text": "My husband and I booked the Sailing, SUP & Snorkel experience from Airlie Beach, and absolutely loved this experience - it was the perfect balance of relaxation and activities. As first-time snorkelers, we were a bit nervous at first, but the clear briefing and Maddy's attentive supervision made us feel completely at ease. We really appreciated being part of a small group of around 20 people, which gave the whole trip a more personal and peaceful vibe compared to crowded cruises. The sailing itself was wonderfully relaxing - you can sunbathe, read, or enjoy a drink (remember to bring your own soft drinks or beers, as you cannot buy them onboard, but there is water, coffee and tea at any point in time). Time flew by! The staff were amazing, and the food was very nice! Thank you again, girls, for such a lovely and memorable day!",
      "author": "Sophie & James",
      "date": "Recent",
      "visited": "Weekday"
    },
    {
      "rating": 5.0,
      "title": "Wow!!! Best tour decision!",
      "text": "Wow!!! Do yourself a favour, book the SUP and snorkeling tour. 6 hours of a relaxing cruise around The Whitsundays. We got to experience some beautiful coral reef and colourful fish. The relaxing music from the vessel let me know I wasn't swimming too far away. There was always someone keeping an eye on you to make sure you are safe.\nThe staff were so friendly and experienced. They made us feel very relaxed and pampered.\nWe enjoyed a sandy beach or you could use the equipment on offer.\nA satisfying morning tea and lunch. We bought our own drinks which were kept cold in the fridge.\nThere are many places to sit on the boat, but we sat down the front on the nets near the Jacuzzi filled with ocean water.\nThe weather; perfect, the food; spot on, the ship; feel what it's like to be a millionaire!\nTo top it off, we saw whales jumping out of the water and their water spray. WHAT A DAY!\nBYO towel, bathers, sunscreen, drinks and snacks and your camera!",
      "author": "Rachel & Mike",
      "date": "Recent"
    }
  ],
  "overall_rating": 4.9,
  "review_count": 305,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/maps/search/Wings+Whitsundays"
}
