{
  "overall_rating": 5,
  "review_count": 6,
  "reviews": [
    {
      "author": "Dionne M",
      "date": "1 month ago",
      "rating": 5,
      "text": "Brad and Rick were amazing and we had the best time on Summertime! The boat was spacious, rooms were comfortable and the food was really good. We took snacks but we definitely didn't need them.\n\nThe lookout and beach were incredible and we really enjoyed the kayaks and snorkelling on the second day.\n\nIf you're wondering what boat to book, definitely book this one!",
      "title": "Amazing crew and incredible experience!"
    },
    {
      "author": "Nico de Ruiter",
      "date": "3 months ago",
      "rating": 5,
      "text": "We had a fantastic two-day sailing trip with hosts Brad and Emily. We felt very welcome from the start. Everything was well explained, and we got to see lots of sea wildlife. Visiting the beautiful Whitsundays early in the morning before the crowds was a real highlight. The food was great, and Brad and Emily were incredibly kind and attentive. Thanks for this memorable experience!",
      "title": "Fantastic two-day sailing trip"
    },
    {
      "author": "Mariona Prat",
      "date": "2 months ago",
      "rating": 5,
      "text": "We loved our 2d1n on Summertime. Such good vibes. Brad and Ricky are amazing as well as the food they cooked. We did many fun activities such as snorkeling, kayaking and walking on whitehaven beach. I highly recommend this experience! One of the most memorable experience you will have on the Australian east coast.",
      "title": "Such good vibes!"
    },
    {
      "author": "Richard T",
      "date": "2 months ago",
      "rating": 5,
      "text": "Brilliant trip. The activities were well managed by Brad and Emily, Hats off to Emily the food was amazing, Brad's expert and knowledgeable information enhanced the whole trip. The summertime was a lovely old boat with plenty of character. I fully recommend this adventure.",
      "title": "Brilliant trip with expert crew"
    },
    {
      "author": "Sarah K",
      "date": "1 month ago",
      "rating": 5,
      "text": "Amazing experience with this crew. They were friendly, knowledgeable, and made our trip fantastic. I highly recommend going with them. They got us on the beach first thing in the morning before all the crowds",
      "title": "Beat the crowds!"
    },
    {
      "author": "Lisa M",
      "date": "7 months ago",
      "rating": 5,
      "text": "I had a wonderful time when I went on a 2d1n boattrip with summertime. A lovely, funny and super nice crew made the trip unforgettable! They served super nice food and we got always snacks after every little adventure. Even if I was sick and the weather was a bit changeable, it was a wonderful time and we went to the right spots at the right time.\nThe whole group was also pretty cool, lots of nice and young people from all over the world.\nI would really recommend to book with them and support these guys!",
      "title": "Wonderful time with amazing crew"
    }
  ],
  "source": "Google Reviews",
  "source_url": "https://www.google.com/maps/place/Summertime+Whitsundays"
}