{
  "reviews": [
    {
      "rating": 5.0,
      "title": "Great experience, lunch was fantastic",
      "text": "Lovely staff, fun and engaging, who shared lots of information about the Whitsundays and surrounding islands. Lunch was fantastic. The stop at Whitehaven Beach felt rushed, making it hard to fully enjoy. The snorkeling spot was good with great corals, but the water was quite murky.",
      "author": "Visitor",
      "date": "Recent"
    },
    {
      "rating": 5.0,
      "title": "Big Fury punches above its weight!",
      "text": "Excellent day with Dave and Luke. Big Fury punches above it's one boat company weight. Fantastic stops timed to miss the big boats and a real quality buffet lunch make this a great value day. Snorkeling spot was perfect and climb up to the lookout wasn't nearly as strenuous as Luke joked! Highly recommended",
      "author": "Satisfied Customer",
      "date": "Recent"
    },
    {
      "rating": 5.0,
      "title": "Exceptional bucket list adventure!",
      "text": "What an exceptional experience! Could not have asked for a better bucket list adventure thru the Whitsundays! I'm writing this a few weeks after our tour, and I've unfortunately forgotten our captain and crews names, but they were phenomenal. Professional, knowledgeable, fun, safe and hilarious too. The itinerary throughout the entire day was perfect and never felt rushed, with adequate time at all stops, including- the infamous Hill Inlet lookout, reef snorkeling, delicious lunch and leisure time on Whitehaven beach, and some of the best whale sightings we've ever encountered. The day met and exceeded our expectations, and a lot of that is thanks to our decision to choose Big Fury- and we highly recommend that you do too. Cheers again from your new American mates from California!",
      "author": "American Mates from California",
      "date": "Recent"
    },
    {
      "rating": 5.0,
      "title": "Best company to go to Whitsundays!",
      "text": "Big Fury, the best company to go to Whitsundays, they gave us lunch, so delicious in the island and when we come back some cookies and cupcakes, really good services. Always nice with us in the snorkeling activity and very very kind, they are 100% recommendations for this trip!!! The prices were great and the food was amazing!!\nMany many thanks guys for doing this day especial!!!!",
      "author": "Happy Traveler",
      "date": "Recent"
    },
    {
      "rating": 5.0,
      "title": "Amazing day with turtles and whales!",
      "text": "What an amazing day we had yesterday. Thank you Dane, Mark and Jasper for making it such a memorable experience for us. The view from Hill Inlet was stunning, I got to see my turtles whilst snorkelling and then to top the day off we saw 5 humpbacks on the way back. Dane even stopped the boat for us to watch the whales. The lunch was amazing on Whitehaven Beach. We cannot fault this trip. We are in awe of The Amazing Whitsundays! Thank you for making this a day to remember 😎",
      "author": "Wildlife Enthusiast",
      "date": "Recent"
    }
  ],
  "overall_rating": 4.7,
  "review_count": 313,
  "source": "Google Reviews",
  "source_url": "https://www.google.com/maps/search/Magic+Whitsundays+Big+Fury"
}
